Revit 2027 API
FreeFormElement.SetFaceOffset Method
 Offsets a planar face of the free form element a certain distance in the normal direction.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetFaceOffset(
	Face face,
	double offset
)
Public Sub SetFaceOffset (
	face As Face,
	offset As Double
)
public:
void SetFaceOffset(
	Face^ face,
	double offset
)
member SetFaceOffset :
        face : Face *
        offset : float -> unit
Parameters
face Face
 The face to offset.
offset Double
 The magnitude of the offset. A positive value offsets out of the input solid. A negative value offsets into the solid shape.
Exceptions
Exception | Condition
ArgumentException |  face does not belong to the solid. -or- The face to be offset should be planar and satisfy constraints of its parent element.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
FreeFormElement Class
Autodesk.Revit.DB Namespace